
# 初始化
1)如果对一个类定义了两个或多个对象，则这些同类的对象之间可以互相赋值对象之间的赋值也是通过赋值运算符“=”进行的。这是通过对赋值运算符的重载实现的。


对象名1 = 对象名2；


对象的赋值只对其中的数据成员赋值，而不对成员函数赋值。类的数据成员中不能包括动态分配的数据，否则在赋值时可能出现严重后果。


2)用一个已有的对象快速地复制出多个完全相同的对象。如


Box box2(box1);


其作用是用已有的对象box1去克隆出一个新对象box2。


其一般形式为


类名 对象2(对象1)；


用对象1复制出对象2。
    通过复制建立对象时调用一个特殊的构造函数—复制构造函数(copy constructor)。形式如下：


//The copy constructor definition.


Box∷Box(const Box& b)


{height=b.height;


width=b.width;


length=b.length;


}


另一种方便用户的复制形式，用赋值号代替括号，如


Box box2=box1;          //用box1初始化box2


其一般形式为  类名 对象名1 = 对象名2；


可以在一个语句中进行多个对象的复制。如


Box box2=box1,box3=box2;


请注意普通构造函数和复制构造函数的区别。


(1) 在形式上


类名(形参表列);      //普通构造函数的声明，如Box(int h,int w,int len);


类名(类名& 对象名);     //复制构造函数的声明，如Box(Box &b);


(2) 在建立对象时，实参类型不同。系统会根据实参的类型决定调用普通构造函数或复制构造函数。如 


Box box1(12,15,16);           //实参为整数，调用普通构造函数


Box box2(box1);               //实参是对象名，调用复制构造函数


（3） 在什么情况下被调用


普通构造函数在程序中建立对象时被调用。


复制构造函数在用已有对象复制一个新对象时被调用，在以下3种情况下需要克隆对象： 


① 程 序中需要新建立一个对象，并用另一个同类的对象对它初始化。② 当函数的参数为类的对象时。在调用函数时需要将实参对象完整地传递给形参，系统是通过调用 复制构造函数来实现的。③ 函数的返回值是类的对象。此时需要将函数中的对象复制一个临时对象并传给该函数的调用处。